/* eslint-disable @typescript-eslint/no-var-requires */
const createTemplate = require('./templates/createTemplate');

// ? Получение значений аргументов командной строки;
const layer = process.argv[2];
const sliceName = process.argv[3];

// ? Массив допустимых слоев для создания шаблона;
const layers = ['features', 'entities', 'pages'];

// ? Проверка наличия корректного значения для слоя в аргументах командной строки;
if (!layer || !layers.includes(layer)) {
    throw new Error(`Укажите слой ${layers.join(' или ')}`);
}

// ? Проверка наличия значения для названия слайса в аргументах командной строки;
if (!sliceName) {
    throw new Error('Укажите название слайса');
}

// ? Вызов функции createTemplate с передачей слоя и названия слайса в качестве аргументов;
createTemplate(layer, sliceName);

// * Предоставленный код представляет собой набор скриптов и шаблонов для автоматизации создания структуры файлов и директорий в проекте, связанного с разработкой веб-приложений с использованием React, Redux Toolkit и других технологий;

// * Вот общая характеристика каждого модуля:

// * createSliceFiles.js:
// todo Создает структуру файлов и директорий для нового Redux - слайса.
// todo Включает генерацию файлов для модели, UI-компонента и публичного API слайса.

// * createModel.js:
// todo Создает структуру файлов и директорий для новой модели Redux - слайса.
// todo Включает генерацию файла редакс - слайса и типа схемы стейта.

// * createUI.js:
// todo Создает структуру файлов и директорий для нового UI-компонента;
// todo Включает генерацию файлов React-компонента, истории компонента для Storybook и файлов стилей;

// * createPublicApi.js:
// todo Создает файл публичного API для нового Redux-слайса, который экспортирует компонент и тип схемы стейта;

// * reduxSliceTemplate.js:
// todo Генерирует шаблонный код для создания Redux-слайса, включая начальное состояние, редукторы и экспорты;

// * schemaTypeTemplate.js:
// todo Генерирует шаблонный код для определения типа схемы стейта в Redux;

// * componentTemplate.js:
// todo Генерирует шаблонный код для React-компонента, включая импорты библиотек и основную структуру компонента;

// * storyTemplate.js:
// todo Генерирует шаблонный код для Storybook истории компонента с использованием Storybook API;

// * styleTemplate.js:
// todo Генерирует шаблонный код для файла стилей компонента в формате SCSS;

// * index.js:
// todo Создает файл index.ts для публичного API, который экспортирует UI-компонет и тип схемы стейта;
